Tekla.Structures.Plugins.InputObjectTypeAttribute
The InputObjectTypeAttribute class is used for storing the type of the input.
Based on the type the system can then correctly ask for user input in the creation.
The attribute is initialized from the custom attribute
[InputObjectType(ConnectionBase.InputObjectType.INPUTOBJECT_PART)]
in the connection source.

Tekla.Structures.Plugins.InputObjectTypeAttribute.#ctor(Tekla.Structures.Plugins.ConnectionBase.InputObjectType)
The custom attribute [InputObjectType()] uses this to store the input object type to the system.
This is not to be used by itself.
Type: The input object type.

Tekla.Structures.Plugins.InputObjectTypeAttribute.Type
The custom attribute [InputObjectType()] uses this to store the input object type to the system.
This is not to be used by itself.

Tekla.Structures.Plugins.InputObjectTypeAttribute.#ctor(System.Int32)
The custom attribute [InputObjectType()] uses this to store the input object type to the system.
This is not to be used by itself.
Type: The input object type.